darwinbeing/hstns-pd44-firmware/svd/dsPIC33FJ64GS606.svd
<?xml version="1.0" encoding="utf-8"?>
<device schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Microchip</vendor>
  <vendorID>Microchip</vendorID>
  <name>dsPIC33FJ64GS606</name>
  <series>dsPIC33FJ64GS</series>
  <version>1.4.228</version>
  <description>Generated from Microchip MPLAB X device pack files p33FJ64GS606.gld and p33FJ64GS606.h</description>
  <addressUnitBits>8</addressUnitBits>
  <width>16</width>
  <size>16</size>
  <access>read-write</access>
  <resetMask>0xFFFF</resetMask>
  <peripherals>
    <peripheral>
      <name>CPU_CORE</name>
      <description>CPU_CORE peripheral registers</description>
      <baseAddress>0x20</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SPLIM</name>
          <addressOffset>0x0</addressOffset>
        </register>
        <register>
          <name>ACCAL</name>
          <addressOffset>0x2</addressOffset>
        </register>
        <register>
          <name>ACCAH</name>
          <addressOffset>0x4</addressOffset>
        </register>
        <register>
          <name>ACCAU</name>
          <addressOffset>0x6</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>ACCBL</name>
          <addressOffset>0x8</addressOffset>
        </register>
        <register>
          <name>ACCBH</name>
          <addressOffset>0xA</addressOffset>
        </register>
        <register>
          <name>ACCBU</name>
          <addressOffset>0xC</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>PCL</name>
          <addressOffset>0xE</addressOffset>
        </register>
        <register>
          <name>PCH</name>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>TBLPAG</name>
          <addressOffset>0x12</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>PSVPAG</name>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>RCOUNT</name>
          <addressOffset>0x16</addressOffset>
        </register>
        <register>
          <name>DCOUNT</name>
          <addressOffset>0x18</addressOffset>
        </register>
        <register>
          <name>DOSTARTL</name>
          <addressOffset>0x1A</addressOffset>
        </register>
        <register>
          <name>DOSTARTH</name>
          <addressOffset>0x1C</addressOffset>
        </register>
        <register>
          <name>DOENDL</name>
          <addressOffset>0x1E</addressOffset>
        </register>
        <register>
          <name>DOENDH</name>
          <addressOffset>0x20</addressOffset>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0x22</addressOffset>
          <fields>
            <field>
              <name>C</name>
              <description>MCU ALU carry/borrow bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>Z</name>
              <description>MCU ALU zero bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OV</name>
              <description>MCU ALU overflow bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>N</name>
              <description>MCU ALU negative bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RA</name>
              <description>REPEAT loop active bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IPL</name>
              <description>CPU interrupt priority level status bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DC</name>
              <description>MCU ALU half carry/borrow bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DA</name>
              <description>DO loop active bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SAB</name>
              <description>Combined accumulator saturation sticky status bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OAB</name>
              <description>Combined accumulator overflow status bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SB</name>
              <description>Accumulator B saturation sticky status bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SA</name>
              <description>Accumulator A saturation sticky status bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OB</name>
              <description>Accumulator B overflow status bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OA</name>
              <description>Accumulator A overflow status bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CORCON</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>IF</name>
              <description>Integer or fractional multiplier mode select bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RND</name>
              <description>Rounding mode select bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PSV</name>
              <description>Program space visibility in data space enable bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IPL3</name>
              <description>CPU interrupt priority level status bit 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACCSAT</name>
              <description>Accumulator saturation mode select bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SATDW</name>
              <description>Data space write from DSP engine saturation enable bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SATB</name>
              <description>Accumulator B saturation enable bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SATA</name>
              <description>Accumulator A saturation enable bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DL</name>
              <description>DO loop nesting level status bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EDT</name>
              <description>Early DO loop termination control bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>US</name>
              <description>DSP multiply unsigned/signed control bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MODCON</name>
          <addressOffset>0x26</addressOffset>
          <fields>
            <field>
              <name>XWM</name>
              <description>MODCON field XWM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>YWM</name>
              <description>MODCON field YWM</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>BWM</name>
              <description>MODCON field BWM</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>YMODEN</name>
              <description>MODCON field YMODEN</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XMODEN</name>
              <description>MODCON field XMODEN</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>XMODSRT</name>
          <addressOffset>0x28</addressOffset>
        </register>
        <register>
          <name>XMODEND</name>
          <addressOffset>0x2A</addressOffset>
        </register>
        <register>
          <name>YMODSRT</name>
          <addressOffset>0x2C</addressOffset>
        </register>
        <register>
          <name>YMODEND</name>
          <addressOffset>0x2E</addressOffset>
        </register>
        <register>
          <name>XBREV</name>
          <addressOffset>0x30</addressOffset>
        </register>
        <register>
          <name>DISICNT</name>
          <addressOffset>0x32</addressOffset>
        </register>
