darwinbeing/hstns-pd44-firmware/svd/dsPIC33FJ64GS606.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIO_CN</name>
      <description>GPIO_CN peripheral registers</description>
      <baseAddress>0x60</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CNEN1</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>CN0IE</name>
              <description>CNEN1 field CN0IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN1IE</name>
              <description>CNEN1 field CN1IE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN2IE</name>
              <description>CNEN1 field CN2IE</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN3IE</name>
              <description>CNEN1 field CN3IE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN4IE</name>
              <description>CNEN1 field CN4IE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN5IE</name>
              <description>CNEN1 field CN5IE</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN6IE</name>
              <description>CNEN1 field CN6IE</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN7IE</name>
              <description>CNEN1 field CN7IE</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN8IE</name>
              <description>CNEN1 field CN8IE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN9IE</name>
              <description>CNEN1 field CN9IE</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN10IE</name>
              <description>CNEN1 field CN10IE</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN11IE</name>
              <description>CNEN1 field CN11IE</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN12IE</name>
              <description>CNEN1 field CN12IE</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN13IE</name>
              <description>CNEN1 field CN13IE</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN14IE</name>
              <description>CNEN1 field CN14IE</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN15IE</name>
              <description>CNEN1 field CN15IE</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CNEN2</name>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>CN16IE</name>
              <description>CNEN2 field CN16IE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN17IE</name>
              <description>CNEN2 field CN17IE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN18IE</name>
              <description>CNEN2 field CN18IE</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CN22IE</name>
              <description>CNEN2 field CN22IE</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN23IE</name>
              <description>CNEN2 field CN23IE</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPU1</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>CN0PUE</name>
              <description>CNPU1 field CN0PUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN1PUE</name>
              <description>CNPU1 field CN1PUE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN2PUE</name>
              <description>CNPU1 field CN2PUE</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN3PUE</name>
              <description>CNPU1 field CN3PUE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN4PUE</name>
              <description>CNPU1 field CN4PUE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN5PUE</name>
              <description>CNPU1 field CN5PUE</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN6PUE</name>
              <description>CNPU1 field CN6PUE</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN7PUE</name>
              <description>CNPU1 field CN7PUE</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN8PUE</name>
              <description>CNPU1 field CN8PUE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN9PUE</name>
              <description>CNPU1 field CN9PUE</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN10PUE</name>
              <description>CNPU1 field CN10PUE</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN11PUE</name>
              <description>CNPU1 field CN11PUE</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN12PUE</name>
              <description>CNPU1 field CN12PUE</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN13PUE</name>
              <description>CNPU1 field CN13PUE</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN14PUE</name>
              <description>CNPU1 field CN14PUE</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN15PUE</name>
              <description>CNPU1 field CN15PUE</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPU2</name>
          <addressOffset>0xA</addressOffset>
          <fields>
            <field>
              <name>CN16PUE</name>
              <description>CNPU2 field CN16PUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN17PUE</name>
              <description>CNPU2 field CN17PUE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN18PUE</name>
              <description>CNPU2 field CN18PUE</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CN22PUE</name>
              <description>CNPU2 field CN22PUE</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CN23PUE</name>
              <description>CNPU2 field CN23PUE</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
