darwinbeing/hstns-pd44-firmware/svd/dsPIC33FJ64GS606.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>IC4</name>
      <description>IC4 peripheral registers</description>
      <baseAddress>0x14C</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IC4BUF</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>IC4BUF</name>
              <description>IC4BUF register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IC4CON</name>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>ICM</name>
              <description>IC4CON field ICM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ICBNE</name>
              <description>IC4CON field ICBNE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ICOV</name>
              <description>IC4CON field ICOV</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ICI</name>
              <description>IC4CON field ICI</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ICTMR</name>
              <description>IC4CON field ICTMR</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>ICSIDL</name>
              <description>IC4CON field ICSIDL</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>OC1</name>
      <description>OC1 peripheral registers</description>
      <baseAddress>0x180</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OC1RS</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>OC1RS</name>
              <description>OC1RS register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC1R</name>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>OC1R</name>
              <description>OC1R register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC1CON</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>OCM</name>
              <description>OC1CON field OCM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>OCTSEL</name>
              <description>OC1CON field OCTSEL</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OCFLT</name>
              <description>OC1CON field OCFLT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>5</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>OCSIDL</name>
              <description>OC1CON field OCSIDL</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>OC2</name>
      <description>OC2 peripheral registers</description>
      <baseAddress>0x186</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OC2RS</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>OC2RS</name>
              <description>OC2RS register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC2R</name>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>OC2R</name>
              <description>OC2R register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC2CON</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>OCM</name>
              <description>OC2CON field OCM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>OCTSEL</name>
              <description>OC2CON field OCTSEL</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OCFLT</name>
              <description>OC2CON field OCFLT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>5</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>OCSIDL</name>
              <description>OC2CON field OCSIDL</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
