darwinbeing/hstns-pd44-firmware/svd/dsPIC33FJ64GS606.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>OC3</name>
      <description>OC3 peripheral registers</description>
      <baseAddress>0x18C</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OC3RS</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>OC3RS</name>
              <description>OC3RS register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC3R</name>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>OC3R</name>
              <description>OC3R register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC3CON</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>OCM</name>
              <description>OC3CON field OCM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>OCTSEL</name>
              <description>OC3CON field OCTSEL</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OCFLT</name>
              <description>OC3CON field OCFLT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>5</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>OCSIDL</name>
              <description>OC3CON field OCSIDL</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>OC4</name>
      <description>OC4 peripheral registers</description>
      <baseAddress>0x192</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OC4RS</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>OC4RS</name>
              <description>OC4RS register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC4R</name>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>OC4R</name>
              <description>OC4R register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OC4CON</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>OCM</name>
              <description>OC4CON field OCM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>OCTSEL</name>
              <description>OC4CON field OCTSEL</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OCFLT</name>
              <description>OC4CON field OCFLT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>5</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>OCSIDL</name>
              <description>OC4CON field OCSIDL</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>QEI1</name>
      <description>QEI1 peripheral registers</description>
      <baseAddress>0x1E0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>QEI1CON</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TQCS</name>
              <description>Timer clock source select bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POSRES</name>
              <description>Position counter reset enable bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TQCKPS</name>
              <description>Timer input clock prescale select bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TQGATE</name>
              <description>Timer gated time accumulation enable bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCDOUT</name>
              <description>Position counter direction state output enable bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWPAB</name>
              <description>Phase A and Phase B input swap select bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QEIM</name>
              <description>Quadrature Encoder Interface mode select bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>UPDN</name>
              <description>Position counter direction status bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INDX</name>
              <description>Index pin state status bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QEISIDL</name>
              <description>QEI stop in Idle mode bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CNTERR</name>
              <description>Position count error status flag bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFLT1CON</name>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>QECK</name>
              <description>Digital filter clock divide select bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>QEOUT</name>
              <description>Digital filter output enable bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEID</name>
              <description>Count error interrupt disable bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IMV</name>
              <description>Index match value bits</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>POS1CNT</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>POS1CNT</name>
              <description>POS1CNT register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MAX1CNT</name>
          <addressOffset>0x6</addressOffset>
          <fields>
            <field>
              <name>MAX1CNT</name>
              <description>MAX1CNT register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
