darwinbeing/hstns-pd44-firmware/svd/dsPIC33FJ64GS606.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>QEI2</name>
      <description>QEI2 peripheral registers</description>
      <baseAddress>0x1F0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>QEI2CON</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TQCS</name>
              <description>Timer clock source select bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POSRES</name>
              <description>Position counter reset enable bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TQCKPS</name>
              <description>Timer input clock prescale select bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>TQGATE</name>
              <description>Timer gated time accumulation enable bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCDOUT</name>
              <description>Position counter direction state output enable bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWPAB</name>
              <description>Phase A and Phase B input swap select bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QEIM</name>
              <description>Quadrature Encoder Interface mode select bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>UPDN</name>
              <description>Position counter direction status bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INDX</name>
              <description>Index pin state status bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QEISIDL</name>
              <description>QEI stop in Idle mode bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CNTERR</name>
              <description>Position count error status flag bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFLT2CON</name>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>QECK</name>
              <description>Digital filter clock divide select bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>QEOUT</name>
              <description>Digital filter output enable bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEID</name>
              <description>Count error interrupt disable bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IMV</name>
              <description>Index match value bits</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>POS2CNT</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>POS2CNT</name>
              <description>POS2CNT register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MAX2CNT</name>
          <addressOffset>0x6</addressOffset>
          <fields>
            <field>
              <name>MAX2CNT</name>
              <description>MAX2CNT register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>I2C1</name>
      <description>I2C1 peripheral registers</description>
      <baseAddress>0x200</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xE</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>I2C1RCV</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>I2C1RCV</name>
              <description>I2C1RCV register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2CRCV</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>I2CRCV</name>
              <description>I2CRCV register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C1TRN</name>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>I2C1TRN</name>
              <description>I2C1TRN register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2CTRN</name>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>I2CTRN</name>
              <description>I2CTRN register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C1BRG</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>I2C1BRG</name>
              <description>I2C1BRG register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C1CON</name>
          <addressOffset>0x6</addressOffset>
          <fields>
            <field>
              <name>SEN</name>
              <description>I2C1CON field SEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSEN</name>
              <description>I2C1CON field RSEN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEN</name>
              <description>I2C1CON field PEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCEN</name>
              <description>I2C1CON field RCEN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACKEN</name>
              <description>I2C1CON field ACKEN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACKDT</name>
              <description>I2C1CON field ACKDT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STREN</name>
              <description>I2C1CON field STREN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GCEN</name>
              <description>I2C1CON field GCEN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMEN</name>
              <description>I2C1CON field SMEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DISSLW</name>
              <description>I2C1CON field DISSLW</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>A10M</name>
              <description>I2C1CON field A10M</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IPMIEN</name>
              <description>I2C1CON field IPMIEN</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SCLREL</name>
              <description>I2C1CON field SCLREL</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2CSIDL</name>
              <description>I2C1CON field I2CSIDL</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2CEN</name>
              <description>I2C1CON field I2CEN</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2CCON</name>
          <addressOffset>0x6</addressOffset>
          <fields>
            <field>
              <name>SEN</name>
              <description>I2CCON field SEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSEN</name>
              <description>I2CCON field RSEN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEN</name>
              <description>I2CCON field PEN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCEN</name>
              <description>I2CCON field RCEN</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACKEN</name>
              <description>I2CCON field ACKEN</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACKDT</name>
              <description>I2CCON field ACKDT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STREN</name>
              <description>I2CCON field STREN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GCEN</name>
              <description>I2CCON field GCEN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMEN</name>
              <description>I2CCON field SMEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DISSLW</name>
              <description>I2CCON field DISSLW</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>A10M</name>
              <description>I2CCON field A10M</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IPMIEN</name>
              <description>I2CCON field IPMIEN</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SCLREL</name>
              <description>I2CCON field SCLREL</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2CSIDL</name>
              <description>I2CCON field I2CSIDL</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2CEN</name>
              <description>I2CCON field I2CEN</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C1STAT</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>TBF</name>
              <description>I2C1STAT field TBF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RBF</name>
              <description>I2C1STAT field RBF</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>S</name>
              <description>I2C1STAT field S</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P</name>
              <description>I2C1STAT field P</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2COV</name>
              <description>I2C1STAT field I2COV</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWCOL</name>
              <description>I2C1STAT field IWCOL</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADD10</name>
              <description>I2C1STAT field ADD10</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GCSTAT</name>
              <description>I2C1STAT field GCSTAT</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BCL</name>
              <description>I2C1STAT field BCL</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_2</name>
              <description>Reserved</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>TRSTAT</name>
              <description>I2C1STAT field TRSTAT</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACKSTAT</name>
              <description>I2C1STAT field ACKSTAT</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2CSTAT</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>TBF</name>
              <description>I2CSTAT field TBF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RBF</name>
              <description>I2CSTAT field RBF</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>S</name>
              <description>I2CSTAT field S</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P</name>
              <description>I2CSTAT field P</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2COV</name>
              <description>I2CSTAT field I2COV</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IWCOL</name>
              <description>I2CSTAT field IWCOL</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADD10</name>
              <description>I2CSTAT field ADD10</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GCSTAT</name>
              <description>I2CSTAT field GCSTAT</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BCL</name>
              <description>I2CSTAT field BCL</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_2</name>
              <description>Reserved</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>TRSTAT</name>
              <description>I2CSTAT field TRSTAT</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACKSTAT</name>
              <description>I2CSTAT field ACKSTAT</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C1ADD</name>
          <addressOffset>0xA</addressOffset>
          <fields>
            <field>
              <name>I2C1ADD</name>
              <description>I2C1ADD register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2CADD</name>
          <addressOffset>0xA</addressOffset>
          <fields>
            <field>
              <name>I2CADD</name>
              <description>I2CADD register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C1MSK</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>I2C1MSK</name>
              <description>I2C1MSK register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
