darwinbeing/hstns-pd44-firmware/svd/dsPIC33FJ64GS606.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SPI1</name>
      <description>SPI1 peripheral registers</description>
      <baseAddress>0x240</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xA</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SPI1STAT</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>SPIRBF</name>
              <description>SPI receive buffer full status bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPITBF</name>
              <description>SPI transmit buffer full status bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SPIROV</name>
              <description>Receive overflow flag bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>7</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>SPISIDL</name>
              <description>SPI stop in Idle mode bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_2</name>
              <description>Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPIEN</name>
              <description>SPI module enable bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI1CON1</name>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>PPRE</name>
              <description>Primary prescale bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SPRE</name>
              <description>Secondary prescale bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MSTEN</name>
              <description>Master mode enable bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKP</name>
              <description>Clock polarity select bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SSEN</name>
              <description>Slave select enable bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKE</name>
              <description>Serial output data change edge select bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMP</name>
              <description>Input data sample phase bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MODE16</name>
              <description>Communication word select bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DISSDO</name>
              <description>SDOx pin control bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DISSCK</name>
              <description>Internal serial clock control bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI1CON2</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRMDLY</name>
              <description>Frame sync pulse edge select bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>FRMPOL</name>
              <description>Frame sync pulse polarity bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPIFSD</name>
              <description>Frame sync pulse direction control bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRMEN</name>
              <description>Framed SPI support enable bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI1BUF</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>SPI1BUF</name>
              <description>SPI1BUF register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
