darwinbeing/hstns-pd44-firmware/svd/dsPIC33FJ64GS606.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC</name>
      <description>ADC peripheral registers</description>
      <baseAddress>0x300</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x74</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ADCON</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>ADCS</name>
              <description>Analog-to-digital conversion clock divider select bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ASYNCSAMP</name>
              <description>Asynchronous dedicated sample-and-hold sampling enable bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEQSAMP</name>
              <description>Sequential sample-and-hold sampling enable bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ORDER</name>
              <description>Conversion order bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EIE</name>
              <description>Early interrupt enable bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FORM</name>
              <description>Data output format bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GSWTRG</name>
              <description>Global software trigger bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_2</name>
              <description>Reserved</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SLOWCLK</name>
              <description>Enable the slow clock divider bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADSIDL</name>
              <description>ADC stop in Idle mode bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_3</name>
              <description>Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADON</name>
              <description>ADC module operating mode bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPCFG</name>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>PCFG0</name>
              <description>ADPCFG field PCFG0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCFG1</name>
              <description>ADPCFG field PCFG1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCFG2</name>
              <description>ADPCFG field PCFG2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCFG3</name>
              <description>ADPCFG field PCFG3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCFG4</name>
              <description>ADPCFG field PCFG4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCFG5</name>
              <description>ADPCFG field PCFG5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCFG6</name>
              <description>ADPCFG field PCFG6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCFG7</name>
              <description>ADPCFG field PCFG7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCFG8</name>
              <description>ADPCFG field PCFG8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCFG9</name>
              <description>ADPCFG field PCFG9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCFG10</name>
              <description>ADPCFG field PCFG10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCFG11</name>
              <description>ADPCFG field PCFG11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCFG12</name>
              <description>ADPCFG field PCFG12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCFG13</name>
              <description>ADPCFG field PCFG13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCFG14</name>
              <description>ADPCFG field PCFG14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCFG15</name>
              <description>ADPCFG field PCFG15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADSTAT</name>
          <addressOffset>0x6</addressOffset>
          <fields>
            <field>
              <name>P0RDY</name>
              <description>ADSTAT field P0RDY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P1RDY</name>
              <description>ADSTAT field P1RDY</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P2RDY</name>
              <description>ADSTAT field P2RDY</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P3RDY</name>
              <description>ADSTAT field P3RDY</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P4RDY</name>
              <description>ADSTAT field P4RDY</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P5RDY</name>
              <description>ADSTAT field P5RDY</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P6RDY</name>
              <description>ADSTAT field P6RDY</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>P7RDY</name>
              <description>ADSTAT field P7RDY</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>P12RDY</name>
              <description>ADSTAT field P12RDY</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADBASE</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>ADBASE</name>
              <description>ADBASE register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCPC0</name>
          <addressOffset>0xA</addressOffset>
          <fields>
            <field>
              <name>TRGSRC0</name>
              <description>ADCPC0 field TRGSRC0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SWTRG0</name>
              <description>ADCPC0 field SWTRG0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEND0</name>
              <description>ADCPC0 field PEND0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQEN0</name>
              <description>ADCPC0 field IRQEN0</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRGSRC1</name>
              <description>ADCPC0 field TRGSRC1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SWTRG1</name>
              <description>ADCPC0 field SWTRG1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEND1</name>
              <description>ADCPC0 field PEND1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQEN1</name>
              <description>ADCPC0 field IRQEN1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCPC1</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>TRGSRC2</name>
              <description>ADCPC1 field TRGSRC2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SWTRG2</name>
              <description>ADCPC1 field SWTRG2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEND2</name>
              <description>ADCPC1 field PEND2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQEN2</name>
              <description>ADCPC1 field IRQEN2</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRGSRC3</name>
              <description>ADCPC1 field TRGSRC3</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SWTRG3</name>
              <description>ADCPC1 field SWTRG3</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEND3</name>
              <description>ADCPC1 field PEND3</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQEN3</name>
              <description>ADCPC1 field IRQEN3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCPC2</name>
          <addressOffset>0xE</addressOffset>
          <fields>
            <field>
              <name>TRGSRC4</name>
              <description>ADCPC2 field TRGSRC4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SWTRG4</name>
              <description>ADCPC2 field SWTRG4</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEND4</name>
              <description>ADCPC2 field PEND4</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQEN4</name>
              <description>ADCPC2 field IRQEN4</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRGSRC5</name>
              <description>ADCPC2 field TRGSRC5</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SWTRG5</name>
              <description>ADCPC2 field SWTRG5</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEND5</name>
              <description>ADCPC2 field PEND5</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQEN5</name>
              <description>ADCPC2 field IRQEN5</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCPC3</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>TRGSRC6</name>
              <description>ADCPC3 field TRGSRC6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SWTRG6</name>
              <description>ADCPC3 field SWTRG6</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEND6</name>
              <description>ADCPC3 field PEND6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQEN6</name>
              <description>ADCPC3 field IRQEN6</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRGSRC7</name>
              <description>ADCPC3 field TRGSRC7</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SWTRG7</name>
              <description>ADCPC3 field SWTRG7</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEND7</name>
              <description>ADCPC3 field PEND7</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQEN7</name>
              <description>ADCPC3 field IRQEN7</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCPC6</name>
          <addressOffset>0x16</addressOffset>
          <fields>
            <field>
              <name>TRGSRC12</name>
              <description>ADCPC6 field TRGSRC12</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SWTRG12</name>
              <description>ADCPC6 field SWTRG12</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PEND12</name>
              <description>ADCPC6 field PEND12</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQEN12</name>
              <description>ADCPC6 field IRQEN12</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUF0</name>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>ADCBUF0</name>
              <description>ADCBUF0 register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUF1</name>
          <addressOffset>0x42</addressOffset>
          <fields>
            <field>
              <name>ADCBUF1</name>
              <description>ADCBUF1 register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUF2</name>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>ADCBUF2</name>
              <description>ADCBUF2 register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUF3</name>
          <addressOffset>0x46</addressOffset>
          <fields>
            <field>
              <name>ADCBUF3</name>
              <description>ADCBUF3 register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUF4</name>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>ADCBUF4</name>
              <description>ADCBUF4 register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUF5</name>
          <addressOffset>0x4A</addressOffset>
          <fields>
            <field>
              <name>ADCBUF5</name>
              <description>ADCBUF5 register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUF6</name>
          <addressOffset>0x4C</addressOffset>
          <fields>
            <field>
              <name>ADCBUF6</name>
              <description>ADCBUF6 register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUF7</name>
          <addressOffset>0x4E</addressOffset>
          <fields>
            <field>
              <name>ADCBUF7</name>
              <description>ADCBUF7 register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUF8</name>
          <addressOffset>0x50</addressOffset>
          <fields>
            <field>
              <name>ADCBUF8</name>
              <description>ADCBUF8 register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUF9</name>
          <addressOffset>0x52</addressOffset>
          <fields>
            <field>
              <name>ADCBUF9</name>
              <description>ADCBUF9 register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUF10</name>
          <addressOffset>0x54</addressOffset>
          <fields>
            <field>
              <name>ADCBUF10</name>
              <description>ADCBUF10 register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUF11</name>
          <addressOffset>0x56</addressOffset>
          <fields>
            <field>
              <name>ADCBUF11</name>
              <description>ADCBUF11 register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUF12</name>
          <addressOffset>0x58</addressOffset>
          <fields>
            <field>
              <name>ADCBUF12</name>
              <description>ADCBUF12 register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUF13</name>
          <addressOffset>0x5A</addressOffset>
          <fields>
            <field>
              <name>ADCBUF13</name>
              <description>ADCBUF13 register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
