darwinbeing/hstns-pd44-firmware/svd/dsPIC33FJ64GS606.svd
        <register>
          <name>ADCBUF14</name>
          <addressOffset>0x5C</addressOffset>
          <fields>
            <field>
              <name>ADCBUF14</name>
              <description>ADCBUF14 register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUF15</name>
          <addressOffset>0x5E</addressOffset>
          <fields>
            <field>
              <name>ADCBUF15</name>
              <description>ADCBUF15 register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUF24</name>
          <addressOffset>0x70</addressOffset>
          <fields>
            <field>
              <name>ADCBUF24</name>
              <description>ADCBUF24 register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBUF25</name>
          <addressOffset>0x72</addressOffset>
          <fields>
            <field>
              <name>ADCBUF25</name>
              <description>ADCBUF25 register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA0</name>
      <description>DMA0 peripheral registers</description>
      <baseAddress>0x380</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DMA0CON</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>MODE</name>
              <description>DMA0CON field MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>AMODE</name>
              <description>DMA0CON field AMODE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>NULLW</name>
              <description>DMA0CON field NULLW</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HALF</name>
              <description>DMA0CON field HALF</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIR</name>
              <description>DMA0CON field DIR</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SIZE</name>
              <description>DMA0CON field SIZE</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHEN</name>
              <description>DMA0CON field CHEN</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA0REQ</name>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>IRQSEL</name>
              <description>DMA0REQ field IRQSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>FORCE</name>
              <description>DMA0REQ field FORCE</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA0STA</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>DMA0STA</name>
              <description>DMA0STA register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA0STB</name>
          <addressOffset>0x6</addressOffset>
          <fields>
            <field>
              <name>DMA0STB</name>
              <description>DMA0STB register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA0PAD</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DMA0PAD</name>
              <description>DMA0PAD register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA0CNT</name>
          <addressOffset>0xA</addressOffset>
          <fields>
            <field>
              <name>DMA0CNT</name>
              <description>DMA0CNT register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
