darwinbeing/hstns-pd44-firmware/svd/dsPIC33FJ64GS606.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA1</name>
      <description>DMA1 peripheral registers</description>
      <baseAddress>0x38C</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DMA1CON</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>MODE</name>
              <description>DMA1CON field MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>AMODE</name>
              <description>DMA1CON field AMODE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>NULLW</name>
              <description>DMA1CON field NULLW</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HALF</name>
              <description>DMA1CON field HALF</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIR</name>
              <description>DMA1CON field DIR</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SIZE</name>
              <description>DMA1CON field SIZE</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHEN</name>
              <description>DMA1CON field CHEN</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA1REQ</name>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>IRQSEL</name>
              <description>DMA1REQ field IRQSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>FORCE</name>
              <description>DMA1REQ field FORCE</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA1STA</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>DMA1STA</name>
              <description>DMA1STA register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA1STB</name>
          <addressOffset>0x6</addressOffset>
          <fields>
            <field>
              <name>DMA1STB</name>
              <description>DMA1STB register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA1PAD</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DMA1PAD</name>
              <description>DMA1PAD register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA1CNT</name>
          <addressOffset>0xA</addressOffset>
          <fields>
            <field>
              <name>DMA1CNT</name>
              <description>DMA1CNT register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA2</name>
      <description>DMA2 peripheral registers</description>
      <baseAddress>0x398</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DMA2CON</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>MODE</name>
              <description>DMA2CON field MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>AMODE</name>
              <description>DMA2CON field AMODE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>NULLW</name>
              <description>DMA2CON field NULLW</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HALF</name>
              <description>DMA2CON field HALF</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIR</name>
              <description>DMA2CON field DIR</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SIZE</name>
              <description>DMA2CON field SIZE</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHEN</name>
              <description>DMA2CON field CHEN</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2REQ</name>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>IRQSEL</name>
              <description>DMA2REQ field IRQSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>FORCE</name>
              <description>DMA2REQ field FORCE</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2STA</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>DMA2STA</name>
              <description>DMA2STA register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2STB</name>
          <addressOffset>0x6</addressOffset>
          <fields>
            <field>
              <name>DMA2STB</name>
              <description>DMA2STB register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2PAD</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DMA2PAD</name>
              <description>DMA2PAD register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2CNT</name>
          <addressOffset>0xA</addressOffset>
          <fields>
            <field>
              <name>DMA2CNT</name>
              <description>DMA2CNT register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
