darwinbeing/hstns-pd44-firmware/svd/dsPIC33FJ64GS606.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA3</name>
      <description>DMA3 peripheral registers</description>
      <baseAddress>0x3A4</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DMA3CON</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>MODE</name>
              <description>DMA3CON field MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>AMODE</name>
              <description>DMA3CON field AMODE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>NULLW</name>
              <description>DMA3CON field NULLW</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HALF</name>
              <description>DMA3CON field HALF</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIR</name>
              <description>DMA3CON field DIR</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SIZE</name>
              <description>DMA3CON field SIZE</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHEN</name>
              <description>DMA3CON field CHEN</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA3REQ</name>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>IRQSEL</name>
              <description>DMA3REQ field IRQSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>7</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>FORCE</name>
              <description>DMA3REQ field FORCE</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA3STA</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>DMA3STA</name>
              <description>DMA3STA register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA3STB</name>
          <addressOffset>0x6</addressOffset>
          <fields>
            <field>
              <name>DMA3STB</name>
              <description>DMA3STB register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA3PAD</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DMA3PAD</name>
              <description>DMA3PAD register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA3CNT</name>
          <addressOffset>0xA</addressOffset>
          <fields>
            <field>
              <name>DMA3CNT</name>
              <description>DMA3CNT register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA</name>
      <description>DMA peripheral registers</description>
      <baseAddress>0x3E0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DMACS0</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>XWCOL0</name>
              <description>DMACS0 field XWCOL0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XWCOL1</name>
              <description>DMACS0 field XWCOL1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XWCOL2</name>
              <description>DMACS0 field XWCOL2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XWCOL3</name>
              <description>DMACS0 field XWCOL3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PWCOL0</name>
              <description>DMACS0 field PWCOL0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PWCOL1</name>
              <description>DMACS0 field PWCOL1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PWCOL2</name>
              <description>DMACS0 field PWCOL2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PWCOL3</name>
              <description>DMACS0 field PWCOL3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACS1</name>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>PPST0</name>
              <description>DMACS1 field PPST0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PPST1</name>
              <description>DMACS1 field PPST1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PPST2</name>
              <description>DMACS1 field PPST2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PPST3</name>
              <description>DMACS1 field PPST3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>LSTCH</name>
              <description>DMACS1 field LSTCH</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DSADR</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>DSADR</name>
              <description>DSADR register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
