darwinbeing/hstns-pd44-firmware/svd/dsPIC33FJ64GS606.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PWM_MASTER</name>
      <description>PWM_MASTER peripheral registers</description>
      <baseAddress>0x400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PTCON</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>SEVTPS</name>
              <description>PTCON field SEVTPS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SYNCSRC</name>
              <description>PTCON field SYNCSRC</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SYNCEN</name>
              <description>PTCON field SYNCEN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCOEN</name>
              <description>PTCON field SYNCOEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCPOL</name>
              <description>PTCON field SYNCPOL</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EIPU</name>
              <description>PTCON field EIPU</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEIEN</name>
              <description>PTCON field SEIEN</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SESTAT</name>
              <description>PTCON field SESTAT</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PTSIDL</name>
              <description>PTCON field PTSIDL</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PTEN</name>
              <description>PTCON field PTEN</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTCON2</name>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>PCLKDIV</name>
              <description>PTCON2 field PCLKDIV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PTPER</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>PTPER</name>
              <description>PTPER register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SEVTCMP</name>
          <addressOffset>0x6</addressOffset>
          <fields>
            <field>
              <name>SEVTCMP</name>
              <description>SEVTCMP register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MDC</name>
          <addressOffset>0xA</addressOffset>
          <fields>
            <field>
              <name>MDC</name>
              <description>MDC register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STCON</name>
          <addressOffset>0xE</addressOffset>
          <fields>
            <field>
              <name>SEVTPS</name>
              <description>STCON field SEVTPS</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SYNCSRC</name>
              <description>STCON field SYNCSRC</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SYNCEN</name>
              <description>STCON field SYNCEN</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCOEN</name>
              <description>STCON field SYNCOEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYNCPOL</name>
              <description>STCON field SYNCPOL</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EIPU</name>
              <description>STCON field EIPU</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEIEN</name>
              <description>STCON field SEIEN</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SESTAT</name>
              <description>STCON field SESTAT</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STCON2</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>PCLKDIV</name>
              <description>STCON2 field PCLKDIV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>3</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STPER</name>
          <addressOffset>0x12</addressOffset>
          <fields>
            <field>
              <name>STPER</name>
              <description>STPER register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SSEVTCMP</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>SSEVTCMP</name>
              <description>SSEVTCMP register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHOP</name>
          <addressOffset>0x1A</addressOffset>
          <fields>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CHOPCLK</name>
              <description>CHOP field CHOPCLK</description>
              <bitOffset>3</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>CHPCLKEN</name>
              <description>CHOP field CHPCLKEN</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
