darwinbeing/hstns-pd44-firmware/svd/dsPIC33FJ64GS606.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PWM3</name>
      <description>PWM3 peripheral registers</description>
      <baseAddress>0x460</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PWMCON3</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>IUE</name>
              <description>PWMCON3 field IUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>XPRES</name>
              <description>PWMCON3 field XPRES</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAM</name>
              <description>PWMCON3 field CAM</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MTBS</name>
              <description>PWMCON3 field MTBS</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTCP</name>
              <description>PWMCON3 field DTCP</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTC</name>
              <description>PWMCON3 field DTC</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MDCS</name>
              <description>PWMCON3 field MDCS</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ITB</name>
              <description>PWMCON3 field ITB</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRGIEN</name>
              <description>PWMCON3 field TRGIEN</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLIEN</name>
              <description>PWMCON3 field CLIEN</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLTIEN</name>
              <description>PWMCON3 field FLTIEN</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRGSTAT</name>
              <description>PWMCON3 field TRGSTAT</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLSTAT</name>
              <description>PWMCON3 field CLSTAT</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLTSTAT</name>
              <description>PWMCON3 field FLTSTAT</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCON3</name>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>OSYNC</name>
              <description>IOCON3 field OSYNC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWAP</name>
              <description>IOCON3 field SWAP</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLDAT</name>
              <description>IOCON3 field CLDAT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FLTDAT</name>
              <description>IOCON3 field FLTDAT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OVRDAT</name>
              <description>IOCON3 field OVRDAT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OVRENL</name>
              <description>IOCON3 field OVRENL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVRENH</name>
              <description>IOCON3 field OVRENH</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PMOD</name>
              <description>IOCON3 field PMOD</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>POLL</name>
              <description>IOCON3 field POLL</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POLH</name>
              <description>IOCON3 field POLH</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PENL</name>
              <description>IOCON3 field PENL</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PENH</name>
              <description>IOCON3 field PENH</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FCLCON3</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>FLTMOD</name>
              <description>FCLCON3 field FLTMOD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>FLTPOL</name>
              <description>FCLCON3 field FLTPOL</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLTSRC</name>
              <description>FCLCON3 field FLTSRC</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>CLMOD</name>
              <description>FCLCON3 field CLMOD</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLPOL</name>
              <description>FCLCON3 field CLPOL</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLSRC</name>
              <description>FCLCON3 field CLSRC</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>IFLTMOD</name>
              <description>FCLCON3 field IFLTMOD</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PDC3</name>
          <addressOffset>0x6</addressOffset>
          <fields>
            <field>
              <name>PDC3</name>
              <description>PDC3 register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PHASE3</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>PHASE3</name>
              <description>PHASE3 register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DTR3</name>
          <addressOffset>0xA</addressOffset>
          <fields>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DTR</name>
              <description>DTR3 dead-time value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ALTDTR3</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ALTDTR</name>
              <description>ALTDTR3 dead-time value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SDC3</name>
          <addressOffset>0xE</addressOffset>
          <fields>
            <field>
              <name>SDC3</name>
              <description>SDC3 register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPHASE3</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>SPHASE3</name>
              <description>SPHASE3 register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIG3</name>
          <addressOffset>0x12</addressOffset>
          <fields>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>TRGCMP</name>
              <description>TRIG3 field TRGCMP</description>
              <bitOffset>3</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TRGCON3</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>TRGSTRT</name>
              <description>TRGCON3 field TRGSTRT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTM</name>
              <description>TRGCON3 field DTM</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>TRGDIV</name>
              <description>TRGCON3 field TRGDIV</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STRIG3</name>
          <addressOffset>0x16</addressOffset>
          <fields>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>STRGCMP</name>
              <description>STRIG3 field STRGCMP</description>
              <bitOffset>3</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWMCAP3</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>PWMCAP</name>
              <description>PWMCAP3 PWM capture value</description>
              <bitOffset>3</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LEBCON3</name>
          <addressOffset>0x1A</addressOffset>
          <fields>
            <field>
              <name>BPLL</name>
              <description>LEBCON3 field BPLL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BPLH</name>
              <description>LEBCON3 field BPLH</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BPHL</name>
              <description>LEBCON3 field BPHL</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BPHH</name>
              <description>LEBCON3 field BPHH</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BCL</name>
              <description>LEBCON3 field BCL</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BCH</name>
              <description>LEBCON3 field BCH</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CLLEBEN</name>
              <description>LEBCON3 field CLLEBEN</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLTLEBEN</name>
              <description>LEBCON3 field FLTLEBEN</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLF</name>
              <description>LEBCON3 field PLF</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLR</name>
              <description>LEBCON3 field PLR</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PHF</name>
              <description>LEBCON3 field PHF</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PHR</name>
              <description>LEBCON3 field PHR</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LEBDLY3</name>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>LEB</name>
              <description>LEBDLY3 field LEB</description>
              <bitOffset>3</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXCON3</name>
          <addressOffset>0x1E</addressOffset>
          <fields>
            <field>
              <name>CHOPLEN</name>
              <description>AUXCON3 field CHOPLEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHOPHEN</name>
              <description>AUXCON3 field CHOPHEN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHOPSEL</name>
              <description>AUXCON3 field CHOPSEL</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BLANKSEL</name>
              <description>AUXCON3 field BLANKSEL</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>HRDDIS</name>
              <description>AUXCON3 field HRDDIS</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HRPDIS</name>
              <description>AUXCON3 field HRPDIS</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
