darwinbeing/hstns-pd44-firmware/svd/dsPIC33FJ64GS606.svd
        <register>
          <name>C1FMSKSEL2</name>
          <addressOffset>0x1A</addressOffset>
          <fields>
            <field>
              <name>F8MSK</name>
              <description>C1FMSKSEL2 field F8MSK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>F9MSK</name>
              <description>C1FMSKSEL2 field F9MSK</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>F10MSK</name>
              <description>C1FMSKSEL2 field F10MSK</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>F11MSK</name>
              <description>C1FMSKSEL2 field F11MSK</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>F12MSK</name>
              <description>C1FMSKSEL2 field F12MSK</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>F13MSK</name>
              <description>C1FMSKSEL2 field F13MSK</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>F14MSK</name>
              <description>C1FMSKSEL2 field F14MSK</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>F15MSK</name>
              <description>C1FMSKSEL2 field F15MSK</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1BUFPNT1</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>F0BP</name>
              <description>C1BUFPNT1 field F0BP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>F1BP</name>
              <description>C1BUFPNT1 field F1BP</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>F2BP</name>
              <description>C1BUFPNT1 field F2BP</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>F3BP</name>
              <description>C1BUFPNT1 field F3BP</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXFUL1</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>RXFUL0</name>
              <description>C1RXFUL1 field RXFUL0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFUL1</name>
              <description>C1RXFUL1 field RXFUL1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFUL2</name>
              <description>C1RXFUL1 field RXFUL2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFUL3</name>
              <description>C1RXFUL1 field RXFUL3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFUL4</name>
              <description>C1RXFUL1 field RXFUL4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFUL5</name>
              <description>C1RXFUL1 field RXFUL5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFUL6</name>
              <description>C1RXFUL1 field RXFUL6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFUL7</name>
              <description>C1RXFUL1 field RXFUL7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFUL8</name>
              <description>C1RXFUL1 field RXFUL8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFUL9</name>
              <description>C1RXFUL1 field RXFUL9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFUL10</name>
              <description>C1RXFUL1 field RXFUL10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFUL11</name>
              <description>C1RXFUL1 field RXFUL11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFUL12</name>
              <description>C1RXFUL1 field RXFUL12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFUL13</name>
              <description>C1RXFUL1 field RXFUL13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFUL14</name>
              <description>C1RXFUL1 field RXFUL14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFUL15</name>
              <description>C1RXFUL1 field RXFUL15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1BUFPNT2</name>
          <addressOffset>0x22</addressOffset>
          <fields>
            <field>
              <name>F4BP</name>
              <description>C1BUFPNT2 field F4BP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>F5BP</name>
              <description>C1BUFPNT2 field F5BP</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>F6BP</name>
              <description>C1BUFPNT2 field F6BP</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>F7BP</name>
              <description>C1BUFPNT2 field F7BP</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXFUL2</name>
          <addressOffset>0x22</addressOffset>
          <fields>
            <field>
              <name>RXFUL16</name>
              <description>C1RXFUL2 field RXFUL16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFUL17</name>
              <description>C1RXFUL2 field RXFUL17</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFUL18</name>
              <description>C1RXFUL2 field RXFUL18</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFUL19</name>
              <description>C1RXFUL2 field RXFUL19</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFUL20</name>
              <description>C1RXFUL2 field RXFUL20</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFUL21</name>
              <description>C1RXFUL2 field RXFUL21</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFUL22</name>
              <description>C1RXFUL2 field RXFUL22</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFUL23</name>
              <description>C1RXFUL2 field RXFUL23</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFUL24</name>
              <description>C1RXFUL2 field RXFUL24</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFUL25</name>
              <description>C1RXFUL2 field RXFUL25</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFUL26</name>
              <description>C1RXFUL2 field RXFUL26</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFUL27</name>
              <description>C1RXFUL2 field RXFUL27</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFUL28</name>
              <description>C1RXFUL2 field RXFUL28</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFUL29</name>
              <description>C1RXFUL2 field RXFUL29</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFUL30</name>
              <description>C1RXFUL2 field RXFUL30</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXFUL31</name>
              <description>C1RXFUL2 field RXFUL31</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1BUFPNT3</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>F8BP</name>
              <description>C1BUFPNT3 field F8BP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>F9BP</name>
              <description>C1BUFPNT3 field F9BP</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>F10BP</name>
              <description>C1BUFPNT3 field F10BP</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>F11BP</name>
              <description>C1BUFPNT3 field F11BP</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1BUFPNT4</name>
          <addressOffset>0x26</addressOffset>
          <fields>
            <field>
              <name>F12BP</name>
              <description>C1BUFPNT4 field F12BP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>F13BP</name>
              <description>C1BUFPNT4 field F13BP</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>F14BP</name>
              <description>C1BUFPNT4 field F14BP</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>F15BP</name>
              <description>C1BUFPNT4 field F15BP</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXOVF1</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>RXOVF0</name>
              <description>C1RXOVF1 field RXOVF0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVF1</name>
              <description>C1RXOVF1 field RXOVF1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVF2</name>
              <description>C1RXOVF1 field RXOVF2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVF3</name>
              <description>C1RXOVF1 field RXOVF3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVF4</name>
              <description>C1RXOVF1 field RXOVF4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVF5</name>
              <description>C1RXOVF1 field RXOVF5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVF6</name>
              <description>C1RXOVF1 field RXOVF6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVF7</name>
              <description>C1RXOVF1 field RXOVF7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVF8</name>
              <description>C1RXOVF1 field RXOVF8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVF9</name>
              <description>C1RXOVF1 field RXOVF9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVF10</name>
              <description>C1RXOVF1 field RXOVF10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVF11</name>
              <description>C1RXOVF1 field RXOVF11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVF12</name>
              <description>C1RXOVF1 field RXOVF12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVF13</name>
              <description>C1RXOVF1 field RXOVF13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVF14</name>
              <description>C1RXOVF1 field RXOVF14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVF15</name>
              <description>C1RXOVF1 field RXOVF15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXOVF2</name>
          <addressOffset>0x2A</addressOffset>
          <fields>
            <field>
              <name>RXOVF16</name>
              <description>C1RXOVF2 field RXOVF16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVF17</name>
              <description>C1RXOVF2 field RXOVF17</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVF18</name>
              <description>C1RXOVF2 field RXOVF18</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVF19</name>
              <description>C1RXOVF2 field RXOVF19</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVF20</name>
              <description>C1RXOVF2 field RXOVF20</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVF21</name>
              <description>C1RXOVF2 field RXOVF21</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVF22</name>
              <description>C1RXOVF2 field RXOVF22</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVF23</name>
              <description>C1RXOVF2 field RXOVF23</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVF24</name>
              <description>C1RXOVF2 field RXOVF24</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVF25</name>
              <description>C1RXOVF2 field RXOVF25</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVF26</name>
              <description>C1RXOVF2 field RXOVF26</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVF27</name>
              <description>C1RXOVF2 field RXOVF27</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVF28</name>
              <description>C1RXOVF2 field RXOVF28</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVF29</name>
              <description>C1RXOVF2 field RXOVF29</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVF30</name>
              <description>C1RXOVF2 field RXOVF30</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOVF31</name>
              <description>C1RXOVF2 field RXOVF31</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM0SID</name>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXM0SID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MIDE</name>
              <description>C1RXM0SID field MIDE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SID</name>
              <description>C1RXM0SID field SID</description>
              <bitOffset>5</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
