darwinbeing/hstns-pd44-firmware/svd/dsPIC33FJ64GS606.svd
        <register>
          <name>C1TR01CON</name>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>TX0PRI</name>
              <description>C1TR01CON field TX0PRI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RTREN0</name>
              <description>C1TR01CON field RTREN0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXREQ0</name>
              <description>C1TR01CON field TXREQ0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXERR0</name>
              <description>C1TR01CON field TXERR0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXLARB0</name>
              <description>C1TR01CON field TXLARB0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXABT0</name>
              <description>C1TR01CON field TXABT0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXEN0</name>
              <description>C1TR01CON field TXEN0</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TX1PRI</name>
              <description>C1TR01CON field TX1PRI</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RTREN1</name>
              <description>C1TR01CON field RTREN1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXREQ1</name>
              <description>C1TR01CON field TXREQ1</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXERR1</name>
              <description>C1TR01CON field TXERR1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXLARB1</name>
              <description>C1TR01CON field TXLARB1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXABT1</name>
              <description>C1TR01CON field TXABT1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXEN1</name>
              <description>C1TR01CON field TXEN1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM0EID</name>
          <addressOffset>0x32</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXM0EID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TR23CON</name>
          <addressOffset>0x32</addressOffset>
          <fields>
            <field>
              <name>TX2PRI</name>
              <description>C1TR23CON field TX2PRI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RTREN2</name>
              <description>C1TR23CON field RTREN2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXREQ2</name>
              <description>C1TR23CON field TXREQ2</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXERR2</name>
              <description>C1TR23CON field TXERR2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXLARB2</name>
              <description>C1TR23CON field TXLARB2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXABT2</name>
              <description>C1TR23CON field TXABT2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXEN2</name>
              <description>C1TR23CON field TXEN2</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TX3PRI</name>
              <description>C1TR23CON field TX3PRI</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RTREN3</name>
              <description>C1TR23CON field RTREN3</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXREQ3</name>
              <description>C1TR23CON field TXREQ3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXERR3</name>
              <description>C1TR23CON field TXERR3</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXLARB3</name>
              <description>C1TR23CON field TXLARB3</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXABT3</name>
              <description>C1TR23CON field TXABT3</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXEN3</name>
              <description>C1TR23CON field TXEN3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM1SID</name>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXM1SID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MIDE</name>
              <description>C1RXM1SID field MIDE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SID</name>
              <description>C1RXM1SID field SID</description>
              <bitOffset>5</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TR45CON</name>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>TX4PRI</name>
              <description>C1TR45CON field TX4PRI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RTREN4</name>
              <description>C1TR45CON field RTREN4</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXREQ4</name>
              <description>C1TR45CON field TXREQ4</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXERR4</name>
              <description>C1TR45CON field TXERR4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXLARB4</name>
              <description>C1TR45CON field TXLARB4</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXABT4</name>
              <description>C1TR45CON field TXABT4</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXEN4</name>
              <description>C1TR45CON field TXEN4</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TX5PRI</name>
              <description>C1TR45CON field TX5PRI</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RTREN5</name>
              <description>C1TR45CON field RTREN5</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXREQ5</name>
              <description>C1TR45CON field TXREQ5</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXERR5</name>
              <description>C1TR45CON field TXERR5</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXLARB5</name>
              <description>C1TR45CON field TXLARB5</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXABT5</name>
              <description>C1TR45CON field TXABT5</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXEN5</name>
              <description>C1TR45CON field TXEN5</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM1EID</name>
          <addressOffset>0x36</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXM1EID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TR67CON</name>
          <addressOffset>0x36</addressOffset>
          <fields>
            <field>
              <name>TX6PRI</name>
              <description>C1TR67CON field TX6PRI</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RTREN6</name>
              <description>C1TR67CON field RTREN6</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXREQ6</name>
              <description>C1TR67CON field TXREQ6</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXERR6</name>
              <description>C1TR67CON field TXERR6</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXLARB6</name>
              <description>C1TR67CON field TXLARB6</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXABT6</name>
              <description>C1TR67CON field TXABT6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXEN6</name>
              <description>C1TR67CON field TXEN6</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TX7PRI</name>
              <description>C1TR67CON field TX7PRI</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RTREN7</name>
              <description>C1TR67CON field RTREN7</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXREQ7</name>
              <description>C1TR67CON field TXREQ7</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXERR7</name>
              <description>C1TR67CON field TXERR7</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXLARB7</name>
              <description>C1TR67CON field TXLARB7</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXABT7</name>
              <description>C1TR67CON field TXABT7</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXEN7</name>
              <description>C1TR67CON field TXEN7</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM2SID</name>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXM2SID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MIDE</name>
              <description>C1RXM2SID field MIDE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SID</name>
              <description>C1RXM2SID field SID</description>
              <bitOffset>5</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM2EID</name>
          <addressOffset>0x3A</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXM2EID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXD</name>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>BIT0</name>
              <description>C1RXD bit 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT1</name>
              <description>C1RXD bit 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT2</name>
              <description>C1RXD bit 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT3</name>
              <description>C1RXD bit 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT4</name>
              <description>C1RXD bit 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT5</name>
              <description>C1RXD bit 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT6</name>
              <description>C1RXD bit 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT7</name>
              <description>C1RXD bit 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT8</name>
              <description>C1RXD bit 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT9</name>
              <description>C1RXD bit 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT10</name>
              <description>C1RXD bit 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT11</name>
              <description>C1RXD bit 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT12</name>
              <description>C1RXD bit 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT13</name>
              <description>C1RXD bit 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT14</name>
              <description>C1RXD bit 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT15</name>
              <description>C1RXD bit 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF0SID</name>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXF0SID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXIDE</name>
              <description>C1RXF0SID field EXIDE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SID</name>
              <description>C1RXF0SID field SID</description>
              <bitOffset>5</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF0EID</name>
          <addressOffset>0x42</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXF0EID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
