darwinbeing/hstns-pd44-firmware/svd/dsPIC33FJ64GS606.svd
        <register>
          <name>C1TXD</name>
          <addressOffset>0x42</addressOffset>
          <fields>
            <field>
              <name>BIT0</name>
              <description>C1TXD bit 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT1</name>
              <description>C1TXD bit 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT2</name>
              <description>C1TXD bit 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT3</name>
              <description>C1TXD bit 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT4</name>
              <description>C1TXD bit 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT5</name>
              <description>C1TXD bit 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT6</name>
              <description>C1TXD bit 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT7</name>
              <description>C1TXD bit 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT8</name>
              <description>C1TXD bit 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT9</name>
              <description>C1TXD bit 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT10</name>
              <description>C1TXD bit 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT11</name>
              <description>C1TXD bit 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT12</name>
              <description>C1TXD bit 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT13</name>
              <description>C1TXD bit 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT14</name>
              <description>C1TXD bit 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT15</name>
              <description>C1TXD bit 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF1SID</name>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXF1SID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXIDE</name>
              <description>C1RXF1SID field EXIDE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SID</name>
              <description>C1RXF1SID field SID</description>
              <bitOffset>5</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF1EID</name>
          <addressOffset>0x46</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXF1EID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF2SID</name>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXF2SID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXIDE</name>
              <description>C1RXF2SID field EXIDE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SID</name>
              <description>C1RXF2SID field SID</description>
              <bitOffset>5</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF2EID</name>
          <addressOffset>0x4A</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXF2EID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF3SID</name>
          <addressOffset>0x4C</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXF3SID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXIDE</name>
              <description>C1RXF3SID field EXIDE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SID</name>
              <description>C1RXF3SID field SID</description>
              <bitOffset>5</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF3EID</name>
          <addressOffset>0x4E</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXF3EID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF4SID</name>
          <addressOffset>0x50</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXF4SID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXIDE</name>
              <description>C1RXF4SID field EXIDE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SID</name>
              <description>C1RXF4SID field SID</description>
              <bitOffset>5</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF4EID</name>
          <addressOffset>0x52</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXF4EID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF5SID</name>
          <addressOffset>0x54</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXF5SID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXIDE</name>
              <description>C1RXF5SID field EXIDE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SID</name>
              <description>C1RXF5SID field SID</description>
              <bitOffset>5</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF5EID</name>
          <addressOffset>0x56</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXF5EID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF6SID</name>
          <addressOffset>0x58</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXF6SID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXIDE</name>
              <description>C1RXF6SID field EXIDE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SID</name>
              <description>C1RXF6SID field SID</description>
              <bitOffset>5</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF6EID</name>
          <addressOffset>0x5A</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXF6EID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF7SID</name>
          <addressOffset>0x5C</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXF7SID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXIDE</name>
              <description>C1RXF7SID field EXIDE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SID</name>
              <description>C1RXF7SID field SID</description>
              <bitOffset>5</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF7EID</name>
          <addressOffset>0x5E</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXF7EID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF8SID</name>
          <addressOffset>0x60</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXF8SID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXIDE</name>
              <description>C1RXF8SID field EXIDE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SID</name>
              <description>C1RXF8SID field SID</description>
              <bitOffset>5</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF8EID</name>
          <addressOffset>0x62</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXF8EID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF9SID</name>
          <addressOffset>0x64</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXF9SID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXIDE</name>
              <description>C1RXF9SID field EXIDE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SID</name>
              <description>C1RXF9SID field SID</description>
              <bitOffset>5</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF9EID</name>
          <addressOffset>0x66</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXF9EID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF10SID</name>
          <addressOffset>0x68</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXF10SID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXIDE</name>
              <description>C1RXF10SID field EXIDE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SID</name>
              <description>C1RXF10SID field SID</description>
              <bitOffset>5</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF10EID</name>
          <addressOffset>0x6A</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXF10EID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF11SID</name>
          <addressOffset>0x6C</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXF11SID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXIDE</name>
              <description>C1RXF11SID field EXIDE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SID</name>
              <description>C1RXF11SID field SID</description>
              <bitOffset>5</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF11EID</name>
          <addressOffset>0x6E</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXF11EID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF12SID</name>
          <addressOffset>0x70</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXF12SID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXIDE</name>
              <description>C1RXF12SID field EXIDE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SID</name>
              <description>C1RXF12SID field SID</description>
              <bitOffset>5</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF12EID</name>
          <addressOffset>0x72</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXF12EID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF13SID</name>
          <addressOffset>0x74</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXF13SID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXIDE</name>
              <description>C1RXF13SID field EXIDE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SID</name>
              <description>C1RXF13SID field SID</description>
              <bitOffset>5</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF13EID</name>
          <addressOffset>0x76</addressOffset>
          <fields>
            <field>
              <name>EID</name>
              <description>C1RXF13EID field EID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
