darwinbeing/hstns-pd44-firmware/svd/dsPIC33FJ64GS606.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>NVM</name>
      <description>NVM peripheral registers</description>
      <baseAddress>0x760</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>NVMCON</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>NVMOP</name>
              <description>NVMCON field NVMOP</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ERASE</name>
              <description>NVMCON field ERASE</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>7</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>WRERR</name>
              <description>NVMCON field WRERR</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WREN</name>
              <description>NVMCON field WREN</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WR</name>
              <description>NVMCON field WR</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMKEY</name>
          <addressOffset>0x6</addressOffset>
          <fields>
            <field>
              <name>NVMKEY</name>
              <description>NVMKEY register value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PMD</name>
      <description>PMD peripheral registers</description>
      <baseAddress>0x770</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xE</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PMD1</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>ADCMD</name>
              <description>PMD1 field ADCMD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>C1MD</name>
              <description>PMD1 field C1MD</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI1MD</name>
              <description>PMD1 field SPI1MD</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPI2MD</name>
              <description>PMD1 field SPI2MD</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>U1MD</name>
              <description>PMD1 field U1MD</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>U2MD</name>
              <description>PMD1 field U2MD</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C1MD</name>
              <description>PMD1 field I2C1MD</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PWMMD</name>
              <description>PMD1 field PWMMD</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QEI1MD</name>
              <description>PMD1 field QEI1MD</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>T1MD</name>
              <description>PMD1 field T1MD</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>T2MD</name>
              <description>PMD1 field T2MD</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>T3MD</name>
              <description>PMD1 field T3MD</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>T4MD</name>
              <description>PMD1 field T4MD</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>T5MD</name>
              <description>PMD1 field T5MD</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD2</name>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>OC1MD</name>
              <description>PMD2 field OC1MD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OC2MD</name>
              <description>PMD2 field OC2MD</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OC3MD</name>
              <description>PMD2 field OC3MD</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OC4MD</name>
              <description>PMD2 field OC4MD</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>IC1MD</name>
              <description>PMD2 field IC1MD</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC2MD</name>
              <description>PMD2 field IC2MD</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC3MD</name>
              <description>PMD2 field IC3MD</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IC4MD</name>
              <description>PMD2 field IC4MD</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD3</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C2MD</name>
              <description>PMD3 field I2C2MD</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>QEI2MD</name>
              <description>PMD3 field QEI2MD</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_2</name>
              <description>Reserved</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CMPMD</name>
              <description>PMD3 field CMPMD</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_3</name>
              <description>Reserved</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD4</name>
          <addressOffset>0x6</addressOffset>
          <fields>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>REFOMD</name>
              <description>PMD4 field REFOMD</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD6</name>
          <addressOffset>0xA</addressOffset>
          <fields>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>PWM1MD</name>
              <description>PMD6 field PWM1MD</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PWM2MD</name>
              <description>PMD6 field PWM2MD</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PWM3MD</name>
              <description>PMD6 field PWM3MD</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PWM4MD</name>
              <description>PMD6 field PWM4MD</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PWM5MD</name>
              <description>PMD6 field PWM5MD</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PWM6MD</name>
              <description>PMD6 field PWM6MD</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD7</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>RESERVED_0</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CMP1MD</name>
              <description>PMD7 field CMP1MD</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP2MD</name>
              <description>PMD7 field CMP2MD</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP3MD</name>
              <description>PMD7 field CMP3MD</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMP4MD</name>
              <description>PMD7 field CMP4MD</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RESERVED_1</name>
              <description>Reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
